---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.DimStyleReadConvention
source: html/9cf0ffe1-2950-8e50-2559-dd775c42d254.htm
---
# Autodesk.Revit.DB.ParameterTypeId.DimStyleReadConvention Property

"Read Convention"

## Syntax (C#)
```csharp
public static ForgeTypeId DimStyleReadConvention { get; }
```